Конфигурация/InformationRegisters/СтоимостьПереоценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьПереоценки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаСоЗнаком</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиЦеныДляПереоценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаКотировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаСоЗнаком</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаКотировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаКотировкиКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаКотировкиКупона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Например, дефолт</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыНоминала</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦеныКупона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенОценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтоимостьПереоценки/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистратор, "Дата, Организация, СчетДоверительногоУправления");
	
	Если (ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров")
			Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.РегистрацияСтоимостиПереоценки")
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "ЦельРасчета") = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении)
		И (РеквизитыДокумента.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ")
			Или РеквизитыДокумента.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ")) Тогда
			
		Запрос = Новый Запрос;
		
#Область Текст_Запроса
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НАЧАЛОПЕРИОДА(СтоимостьПереоценки.Период, ДЕНЬ) КАК Дата,
			|	СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СтоимостьПереоценки.Организация КАК Организация
			|ПОМЕСТИТЬ _НаборДанныхДоИзменения
			|ИЗ
			|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
			|ГДЕ
			|	СтоимостьПереоценки.Регистратор = &Регистратор
			|	И СтоимостьПереоценки.Организация = &Организация
			|	И СтоимостьПереоценки.Активность
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НАЧАЛОПЕРИОДА(НовыйНаборДанных.Период, ДЕНЬ) КАК Дата,
			|	НовыйНаборДанных.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НовыйНаборДанных.Организация КАК Организация,
			|	НовыйНаборДанных.Активность КАК Активность
			|ПОМЕСТИТЬ _НовыйНаборДанных
			|ИЗ
			|	&НовыйНаборДанных КАК НовыйНаборДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_НаборДанныхДоИзменения.Дата КАК Дата,
			|	_НаборДанныхДоИзменения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_НаборДанныхДоИзменения.Организация КАК Организация
			|ИЗ
			|	_НаборДанныхДоИзменения КАК _НаборДанныхДоИзменения
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	_НовыйНаборДанных.Дата,
			|	_НовыйНаборДанных.СчетДоверительногоУправления,
			|	_НовыйНаборДанных.Организация
			|ИЗ
			|	_НовыйНаборДанных КАК _НовыйНаборДанных
			|ГДЕ
			|	_НовыйНаборДанных.Активность";
#КонецОбласти
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.УстановитьПараметр("Организация", РеквизитыДокумента.Организация);
		Запрос.УстановитьПараметр("НовыйНаборДанных", ЭтотОбъект.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПараметрыОтложенногоЗаданияВыгрузкиДанныхВAssets", РезультатЗапроса.Выгрузить());
		КонецЕсли;
			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьОтложенноеЗаданиеВыгрузкиДанныхВАссетс()
	
	ТекДатаСеанса = ТекущаяДатаСеанса();
	
	Выходной = Не Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекДатаСеанса);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_ЭкспортДанныхДляРисков");
		
	Если ОбработкаСсылка = Неопределено Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку("В справочнике дополнительных отчетов и обработок отсутствует обработка с именем [_ЭкспортДанныхДляРисков]", "Экспорт данных для рисков");
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаПараметров Из ЭтотОбъект.ДополнительныеСвойства.ПараметрыОтложенногоЗаданияВыгрузкиДанныхВAssets Цикл
		
		//Не создаем фоновые задания, пока в текущем дне не запускалось регламентное задание (по расписанию в 15:00).
		Если СтрокаПараметров.Дата >= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекДатаСеанса, ?(Выходной , -1, -2)) И (Час(ТекДатаСеанса) < 15 Или Выходной) Тогда
			Продолжить;		
		КонецЕсли;
		
		ПараметрыОбработки = Новый Структура("Дата, Организация, СчетДоверительногоУправления, ИсточникОшибки",,,, "Экспорт данных для рисков");
		ЗаполнитьЗначенияСвойств(ПараметрыОбработки, СтрокаПараметров); 
			
		ДатаЗапуска = ?(Час(ТекДатаСеанса) < 16 И Минута(ТекДатаСеанса) < 15, ТекДатаСеанса + 15 * 60, Неопределено);
		
		РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ОбработкаСсылка, "ЭкспортДанныхВ_Assets1C8", ПараметрыОбработки, 15, Истина, ДатаЗапуска);
							
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ПараметрыОтложенногоЗаданияВыгрузкиДанныхВAssets") Тогда
		СоздатьОтложенноеЗаданиеВыгрузкиДанныхВАссетс();
	КонецЕсли;
	
КонецПроцедуры
